AchimPieters/esp32-homekit-Sunshade/main/main.c
/**
 *  HomeKit Sunshade – ESP32
 *  - Button double-click (STOP -> 50%)
 *  - Calibration with NVS persistence
 *  - NeoPixel status animations
 *
 *  Copyright 2025 Achim Pieters | StudioPieters®
 *  Licensed as in original header…
 *  More info: https://www.studiopieters.nl
 *
 *  Notes:
 *  - This file expects the Kconfig you supplied (classic ESP32 ranges 0..39).
 *  - For ESP32-S3 / ESP32-C3 recommended pin maps are listed below as comments.
 */

#include <stdio.h>
#include <string.h>
#include <stdint.h>
#include <inttypes.h>
#include <math.h>              // sinf
#include <esp_log.h>
#include <esp_err.h>
#include <esp_check.h>         // ESP_RETURN_ON_ERROR
#include <esp_timer.h>         // esp_timer_get_time
#include <nvs.h>
#include <nvs_flash.h>
#include <freertos/FreeRTOS.h>
#include <freertos/task.h>
#include <driver/gpio.h>
#include <homekit/homekit.h>
#include <homekit/characteristics.h>

#include "esp32-lcm.h"
#include <button.h>            // achimpieters/esp32-button

// NeoPixel (WS2812) via ESP-IDF led_strip (RMT)
#include "led_strip.h"
#include "driver/rmt_tx.h"

// -----------------------------------------------------------------------------
// Pin configuration through Kconfig (classic ESP32 ranges 0..39)
// -----------------------------------------------------------------------------
#define LED_GPIO                  CONFIG_ESP_LED_GPIO     // Identify LED (separate from NeoPixel)

// Relays
#define RELAY_OPEN_GPIO           CONFIG_ESP_OPEN_GPIO
#define RELAY_CLOSE_GPIO          CONFIG_ESP_CLOSE_GPIO
#define RELAY_ACTIVE_LEVEL        CONFIG_RELAY_ACTIVE_LEVEL   // 1 = active HIGH, 0 = active LOW

// Buttons (esp32-button component)
#define BTN_OPEN_GPIO             CONFIG_BTN_OPEN_GPIO
#define BTN_STOP_GPIO             CONFIG_BTN_STOP_GPIO
#define BTN_CLOSE_GPIO            CONFIG_BTN_CLOSE_GPIO
#ifndef CONFIG_BUTTON_ACTIVE_LEVEL
#define CONFIG_BUTTON_ACTIVE_LEVEL 0                           // default: active LOW (to GND with internal pull-up)
#endif

// NeoPixel
#define NEOPIXEL_GPIO             CONFIG_NEOPIXEL_GPIO
#define NEOPIXEL_LED_COUNT        1

// Motion model (fallback). Will be overridden after calibration load from NVS.
#define FULL_TRAVEL_MS_DEFAULT    18000
#define MOVE_TICK_MS              100
#define DIRECTION_CHANGE_GUARD_MS 200   // ms pause between reversing commands
#define MID_POSITION              50     // used for STOP double-click

// -----------------------------------------------------------------------------
// (Optional) Target-specific pin map guidance (informational)
// -----------------------------------------------------------------------------
// ESP32-S3 (if you plan to target it):
//   Safe outputs: 1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,38,39,40,41,42,45,46
//   Strapping pins: 0, 3, 45, 46 (avoid for buttons/relays unless you know the boot implications)
//   Suggested defaults: RELAY 16/17, Buttons 8/9/10, NeoPixel 18, LED 13
//
// ESP32-C3:
//   Valid GPIOs: 0..10,18,19
//   Strapping pins: 2,8 (be careful), 0 is boot mode (avoid fixed pulls)
//   Suggested defaults: RELAY 6/7, Buttons 3/4/5, NeoPixel 8 or 10, LED 2
//
// Your provided Kconfig keeps ranges 0..39 for classic ESP32; adjust Kconfig
// per target if you decide to support S3/C3 in the same project tree.

// -----------------------------------------------------------------------------
// Identify LED (GPIO) – separate from NeoPixel animations
// -----------------------------------------------------------------------------
static bool led_on = false;
static inline void led_write(bool on) {
        gpio_set_level(LED_GPIO, on ? 1 : 0);
}
static void gpio_init_led(void) {
        gpio_reset_pin(LED_GPIO);
        gpio_set_direction(LED_GPIO, GPIO_MODE_OUTPUT);
        led_write(led_on);
}

// -----------------------------------------------------------------------------
// Relays (with interlock)
// -----------------------------------------------------------------------------
static const char *MOTOR_TAG = "MOTOR";

static inline void relay_write(gpio_num_t pin, bool on) {
        gpio_set_level(pin, (on ? RELAY_ACTIVE_LEVEL : !RELAY_ACTIVE_LEVEL));
}
static void motor_all_off(void) {
        relay_write(RELAY_OPEN_GPIO, false);
        relay_write(RELAY_CLOSE_GPIO, false);
}
static void motor_drive_open(bool on) {
        if (on) relay_write(RELAY_CLOSE_GPIO, false);
        relay_write(RELAY_OPEN_GPIO, on);
}
static void motor_drive_close(bool on) {
        if (on) relay_write(RELAY_OPEN_GPIO, false);
        relay_write(RELAY_CLOSE_GPIO, on);
}
static void gpio_init_motor(void) {
        gpio_reset_pin(RELAY_OPEN_GPIO);
        gpio_reset_pin(RELAY_CLOSE_GPIO);
        gpio_set_direction(RELAY_OPEN_GPIO, GPIO_MODE_OUTPUT);
        gpio_set_direction(RELAY_CLOSE_GPIO, GPIO_MODE_OUTPUT);
        motor_all_off();
}

// -----------------------------------------------------------------------------
// NeoPixel (status)
// -----------------------------------------------------------------------------
static led_strip_handle_t s_strip = NULL;

static void neopixel_set_rgb(uint8_t r, uint8_t g, uint8_t b) {
        if (!s_strip) return;
        led_strip_set_pixel(s_strip, 0, r, g, b);
        led_strip_refresh(s_strip);
}
static void neopixel_off(void) {
        neopixel_set_rgb(0, 0, 0);
}

typedef enum {
        PIX_IDLE = 0,
        PIX_OPENING,
        PIX_CLOSING,
        PIX_STOPPED,
        PIX_CALIBRATING,
        PIX_WIFI_WAIT
} pix_state_t;

static pix_state_t pix_state = PIX_WIFI_WAIT;

// Simple breathing animation; task period = 50ms
static void neopixel_anim_task(void *arg) {
        uint8_t t = 0;
        while (1) {
                switch (pix_state) {
                case PIX_WIFI_WAIT: { // Orange breathing
                        uint8_t v = (uint8_t)(8 + (7 * (1 + sinf(t / 10.0f))));
                        neopixel_set_rgb(v * 2, v, 0);
                } break;
                case PIX_CALIBRATING: { // Purple breathing
                        uint8_t v = (uint8_t)(6 + (6 * (1 + sinf(t / 8.0f))));
                        neopixel_set_rgb(v, 0, v * 2);
                } break;
                case PIX_OPENING:  neopixel_set_rgb(0, 40, 0);  break;// Green solid
                case PIX_CLOSING:  neopixel_set_rgb(40, 0, 0);  break;// Red solid
                case PIX_STOPPED:  neopixel_set_rgb(0, 25, 25); break;// Cyan solid
                case PIX_IDLE:     neopixel_set_rgb(8, 8, 8);   break;// Soft white
                }
                t++;
                vTaskDelay(pdMS_TO_TICKS(50));
        }
}

static void neopixel_init(void) {
        // In ESP-IDF 5.x, led_strip_* creates/owns the RMT channel; no need to allocate one manually.
        led_strip_config_t strip_config = {
                .strip_gpio_num = NEOPIXEL_GPIO,
                .max_leds = NEOPIXEL_LED_COUNT,
        };
        led_strip_rmt_config_t rmt_config = {
                .resolution_hz = 10 * 1000 * 1000, // 10 MHz
                .flags = { .with_dma = false },
        };
        ESP_ERROR_CHECK(led_strip_new_rmt_device(&strip_config, &rmt_config, &s_strip));
        ESP_ERROR_CHECK(led_strip_clear(s_strip)); // off
        xTaskCreate(neopixel_anim_task, "np_anim", 2048, NULL, 1, NULL);
}

